<template>
    <v-row
      justify="center" 
      align-content="center"
      class="my-5 mx-auto"
    >
        <v-sheet 
            max-width="80%"
        >

            <h2>{{ $t(`pages.privacyPpolicy`) }}</h2>

            <v-col
                justify="center" 
                align-content="center"
                class="my-5 mx-auto"
            >
                <h4>1. 個人情報の利用目的</h4>
                <p class="text-justify">
                    当サービスでは、SNSやメールでのお問い合わせの際に、
                    名前（ハンドルネーム）、メールアドレス等の個人情報をご連絡いただく場合がございます。
                    これらの個人情報は質問に対する回答や必要な情報をご連絡する場合に利用させていただくものであり、
                    それ以外の目的では利用いたしません。
                </p>

                <h4>2. 個人情報の第三者への開示</h4>
                <p class="text-justify">
                    当サービスでは、個人情報は適切に管理し、以下に該当する場合を除いて第三者に開示することはありません。
                </p>
                <ul>
                    <li>本人の許可がある場合</li>
                    <li>法令等への協力のため、開示が必要となる場合</li>
                </ul>
                
                <h4>3. アクセス解析ツールについて</h4>
                <p>
                    当サービスでは、Googleアナリティクスを利用しています。
                    このGoogleアナリティクスはトラフィックデータの収集のためにCookieを使用しています。
                    このトラフィックデータは匿名で収集されており、個人を特定するものではありません。
                    なお、この機能はCookieを無効にすることで収集を拒否することが出来ます。
                </p>

                <h4>4. 免責事項</h4>
                <p>
                    当サービスはその動作において信頼性、正確性、完全性について保証するものではありません。
                    当サービスの利用によって生じた直接的、また間接的トラブル、損失、損害については、一切の責任を負いません。
                </p>

                <h4>第9条（プライバシーポリシーの変更）</h4>
                <p>
                    本ポリシーの内容は，法令その他本ポリシーに別段の定めのある事項を除いて、
                    ユーザーに通知することなく、変更することができるものとします。
                    当サービスが別途定める場合を除いて、変更後のプライバシーポリシーは
                    本ウェブサイトに掲載したときから効力を生じるものとします。
                </p>
            </v-col>
        </v-sheet>
    </v-row>
</template>

<script>
export default {
  layout: 'beforeLogin',
}
</script>